import { skill } from './skilllib.js';

// プレイヤーの初期スキル
export let playerActions = {
    No1: [skill[1]],
    No2: [skill[2]],
    No3: [skill[3]],
    No4: [skill[4]],
    No5: [skill[5]]
};

// 敵図鑑
export const enemies = {
    // A0: 技ID A1:その技の発動確率  A:技の名前 B:プレイヤーに与えるダメージ  B1:プレイヤーの最大体力増減　C:敵が回復する量  C1:敵の最大体力の増減　D:敵が得るシールド　E:敵が得るマナ　F:その技のマナコスト　G:効果発動回数　H:プレイヤー受ダメ増加
    盗賊: [
        { A0: 1, A1: 0.4, A: "たいあたり", B: 3, B1: 0, C: 0, C1: 0, D: 0, E: 0, F: 0, G: 1, H: 0 },
        { A0: 2, A1: 0.3, A: "まもる", B: 0, B1: 0, C: 0, C1: 0, D: 2, E: 0, F: 0, G: 1, H: 0 },
        { A0: 3, A1: 0.3, A: "薬草", B: 0, B1: 0, C: 3, C1: 0, D: 0, E: 0, F: 0, G: 1, H: 0 }
    ],
    魔術師: [
        { A0: 6, A1: 0.3, A: "シールド", B: 0, B1: 0, C: 0, C1: 0, D: 5, E: -2, F: 2, G: 1, H: 0 },
        { A0: 7, A1: 0.2, A: "アイスショック", B: 9, B1: 0, C: 0, C1: 0, D: 0, E: -3, F: 3, G: 1, H: 0 },
        { A0: 4, A1: 0.5, A: "詠唱", B: 0, B1: 0, C: 0, C1: 0, D: 0, E: 2, F: 0, G: 1, H: 0 }
    ],
    冒険者: [
        { A0: 8, A1: 0, A: "シャベル", B: 2, B1: 0, C: 0, C1: 0, D: 0, E: 0, F: 0, G: 2, H: 0 },
        { A0: 9, A1: 0, A: "採掘", B: 1, B1: 0, C: 0, C1: 0, D: 0, E: 1, F: 0, G: 1, H: 1 },
        { A0: 10, A1: 0, A: "詠唱", B: 0, B1: 0, C: 0, C1: 0, D: 0, E: 2, F: 0, G: 1, H: 0 }
    ],
};