export const skill =[
    // A:技の名前 A1:技の説明 B:敵に与えるダメージ　B1:敵の最大体力の増減　C:プレイヤーが得るシールド C1:プレイヤーの最大体力増減　D:プレイヤーが回復する量　
    // E1:プレイヤーが得るRマナ E2:プレイヤーが得るBマナ E3:プレイヤーが得るYマナ  F1:その技のRマナコスト F2:その技のBマナコスト F3:その技のYマナコスト　
    // G:発動回数 H:敵受ダメ増加　H1:プレイヤー与ダメ増加　I: 特殊効果管理　J: 排除管理
    //{ A: "...", A1: "...", B: [], B1: [], C: [], C1: [], D: [], E: [], F: [], G: [], H: [] },

    { No:  1, A: "わるあがき", A1: "相手に1ダメージ", B: 1,G: 1},
    { No:  2, A: "パンチ", A1: "相手に3ダメージ", B: 3, G: 1 },
    { No:  3, A: "固まる", A1: "シールドを2得る", C: 2, G: 1},
    { No:  4, A: "溶ける", A1: "次のターン全てのダメージを無効化", G: 1 , I: 3 },
    { No:  5, A: "溜め込む", A1: "🔴 +1 🔵 +1 🟡 +1", E1: 1 , E2: 1 , E3: 1 , G: 1},
    { No:  6, A: "スライムショット", A1: "🔴 -3 8ダメージを与え 相手の受けるダメージが 1 増える", B: 8, E1: -3, F1: 3, G: 1, H: 1 },
    { No:  7, A: "全力タックル", A1: "🔴 -1 🟡 -1 7ダメージを与える", B: 7, G: 1},
    { No:  8, A: "まねっこ", A1: "次に選んだ技を2回発動する", G: 1, I: 1},
    { No:  9, A: "パワーチャージ", A1: "🔴 +3", E1: 3, G: 1},
    { No: 10, A: "シールド魔法", A1: "🔵 -2 シールドを5得る", D: 5, E2: -2, F2: 2, G : 1 },
    { No: 11, A: "ブリザード", A1: "🔴 -2 🔵 -2", B: 10, E1: -2, E3: -2, F1: 2, F3: 2, G: 1},
    { No: 12, A: "暗黒ボール", A1: "🔴 -1 🟡 -3", B: 9, B1: 7 , E1: -1, E3: -3, F1: 1, F3: 3, G: 1},
    { No: 13, A: "弱体化", A1: "🔴 -1 🔵 -1 🟡 -1 相手の受けるダメージが 2 増える", E1: -1, E2: -1, E3: -1, F1: 1, F2: 1, F3: 1, G: 1, H: 2},
    { No: 14, A: "詠唱・赤", A1: "🔴 +2",E1: 2, G: 1},
    { No: 15, A: "詠唱・青", A1: "🔵 +2",E2: 2, G: 1},
    { No: 16, A: "詠唱・黄", A1: "🟡 +2",E3: 2, G: 1},
    { No: 17, A: "石のつぶて", A1: "相手に2回2ダメージ", B: 1, G: 3},
    { No: 18, A: "原石発見", A1: "🟡 +2 次の自分のターン 手札 +1", E3: 2, G: 1, I: 2 },
    { No: 19, A: "ロックスロー", A1: "🟡 -1 相手に3ダメージ 自分の与えるダメージが +1", B: 3 , E3: -1, F3: 1, G: 1, H1: 1},
    { No: 20, A: "ポリッシュ", A1: "[排除] 🟡 -3 ダメージを受けたとき 自分の与えるダメージが +1 ", B: 3 , E3: -3, F3: 3, G: 1, H1: 1, J: 1},
]