export const skill =[
    // A:技の名前 A1:技の説明 B:敵に与えるダメージ　B1:敵の最大体力の増減　C:プレイヤーが得るシールド C1:プレイヤーの最大体力増減　D:プレイヤーが回復する量　E:プレイヤーが得るマナ F:その技のマナコスト G:発動回数 H:敵受ダメ増加
    //{ A: "...", A1: "...", B: [], B1: [], C: [], C1: [], D: [], E: [], F: [], G: [], H: [] },
    { A: "わるあがき", A1: "<br>相手に1ダメージ", B: 1, B1: 0, C: 0, C1: 0, D: 0, E: 0, F: 0, G: 1, H: 0 },
    { A: "たいあたり", A1: "<br>相手に3ダメージ", B: 3, B1: 0, C: 0, C1: 0, D: 0, E: 0, F: 0, G: 1, H: 0 },
    { A: "守る", A1: "<br>シールドを2獲得", B: 0, B1: 0, C: 2, C1: 0, D: 0, E: 0, F: 0, G: 1, H: 0 },
    { A: "薬草", A1: "<br>体力を3回復", B: 0, B1: 0, C: 0, C1: 0, D: 3, E: 0, F: 0, G: 1, H: 0 },
    { A: "詠唱", A1: "<br>マナを2獲得", B: 0, B1: 0, C: 0, C1: 0, D: 0, E: 2, F: 0, G: 1, H: 0 },
    { A: "ファイア", A1: "<br>2マナ消費する。<br>相手に6ダメージ", B: 6, B1: 0, C: 0, C1: 0, D: 0, E: -2, F: 2, G: 1, H: 0 },
    { A: "シールド", A1: "<br>2マナ消費する。<br>シールドを5獲得する", B: 0, B1: 0, C: 5, C1: 0, D: 0, E: -2, F: 2, G: 1, H: 0 },
    { A: "アイスショック", A1: "<br>3マナ消費する。相手に9ダメージ", B: 9, B1: 0, C: 0, C1: 0, D: 0, E: -3, F: 3, G: 1, H: 0 },
    { A: "シャベル", A1: "<br>相手に2回 2ダメージ", B: 2, B1: 0, C: 0, C1: 0, D: 0, E: 0, F: 0, G: 2, H: 0 },
    { A: "採掘", A1: "<br>相手に1ダメージを与え<br>1マナを得て<br>相手の受けるダメージを1増やす", B: 1, B1: 0, C: 0, D: 0, E: 1, F: 0, G: 1, H: 1},
    { A: "...", A1: "...", B: [], B1: [], C: [], C1: [], D: [], E: [], F: [], G: [], H: [] },
]